000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.   A7SSOPER.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600
000700 LINKAGE SECTION.
000800 01 DFHCOMMAREA.
000900   05 LS-NUM1    PIC 9(9).
000910   05 LS-NUM2    PIC 9(9).
000920   05 LS-TYPEOP  PIC X.
000930   05 LS-RES     PIC 9(10).
001000
001100 PROCEDURE DIVISION USING DFHCOMMAREA.
001200     MOVE ZERO TO LS-RES
001210     EVALUATE LS-TYPEOP
001220        WHEN '-'
001221          COMPUTE LS-RES = LS-NUM1 - LS-NUM2
001222        WHEN '*'
001223          COMPUTE LS-RES = LS-NUM1 * LS-NUM2
001224        WHEN '/'
001225          IF LS-NUM2 NOT = ZERO
001226             COMPUTE LS-RES = LS-NUM1 / LS-NUM2
001227          END-IF
001228        WHEN OTHER
001229          MOVE '+' TO LS-TYPEOP
001230          COMPUTE LS-RES = LS-NUM1 + LS-NUM2
001231     END-EVALUATE
001240
001250     EXEC CICS     RETURN    END-EXEC.
001260
