000100 ID DIVISION.
000200 PROGRAM-ID. P7INFOS.
000220
000230 ENVIRONMENT DIVISION.
000240
000250 DATA DIVISION.
000260 WORKING-STORAGE SECTION.
000270 77 WS-MSG-TEXT   PIC X(22).
000271 77 WS-MSG-LENG   PIC S9(4) COMP.
000280
000290 PROCEDURE DIVISION.
000291
000292     MOVE 'BONJOUR VERRIER ALEXIS' TO WS-MSG-TEXT
000293     MOVE LENGTH OF WS-MSG-TEXT TO WS-MSG-LENG
000294
000295     EXEC CICS
000296        SEND FROM (WS-MSG-TEXT)
000297             LENGTH (WS-MSG-LENG)
000298             ERASE
000299             WAIT
000300     END-EXEC.
000310
000400     EXEC CICS RETURN END-EXEC.
000500
