000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TP07.
000300 AUTHOR.        ALEXIS.
000400 INSTALLATION.  AJC.
000500 DATE-WRITTEN.  26/06/2025.
000600 DATE-COMPILED.
000700 SECURITY.      PROGRAMME COBOL TP07.
000800**************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001210
001300 INPUT-OUTPUT SECTION.
001400 FILE-CONTROL.
001500     SELECT EMPK ASSIGN FEMPK
001600         ORGANIZATION IS INDEXED
001601         ACCESS MODE IS RANDOM
001602         RECORD KEY IS CODE-EMPK
001603         FILE STATUS IS FS-EMPK.
001604     SELECT EMPMAJ ASSIGN FEMPMAJ
001612         ORGANIZATION IS SEQUENTIAL
001613         ACCESS MODE IS SEQUENTIAL
001614         FILE STATUS IS FS-EMPMAJ.
001615
001620**************************************************
001700 DATA DIVISION.
001701 FILE SECTION.
001702 FD EMPK.
001703 01 ENR-EMPK.
001704    05 CODE-EMPK  PIC X(5).
001705    05 NOM-EMPK   PIC X(15).
001706    05 PREN-EMPK  PIC X(15).
001707    05 CP-EMPK    PIC X(5).
001708    05 VILLE-EMPK PIC X(20).
001709    05 SALAIRE-EMPK PIC 9(5)V99.
001711    05 FILLER PIC X(3).
001712
001713 FD EMPMAJ.
001714 01 ENR-EMPMAJ.
001715    05 CODE-EMPMAJ PIC X(5).
001716    05 NOM-EMPMAJ PIC X(15).
001717    05 PREN-EMPMAJ PIC X(15).
001718    05 CP-EMPMAJ    PIC X(5).
001719    05 VILLE-EMPMAJ PIC X(20).
001720    05 SALAIRE-EMPMAJ PIC 9(5)V99.
001721    05 CODE-MAJ   PIC X.
001722     88 CREATION VALUE 'C'.
001723     88 MODIFICATION VALUE 'M'.
001724     88 SUPPRESSION VALUE 'S'.
001725     88 INVALIDE VALUE 'E'.
001726    05 FILLER PIC X(2).
001734
001735 WORKING-STORAGE SECTION.
001736 77 FS-EMPK PIC 99.
001737 77 FS-EMPMAJ PIC 99.
001738 77 WS-FIN-EMPK PIC 9 VALUE ZERO.
001739 77 WS-FIN-EMPMAJ PIC 9 VALUE ZERO.
001740 77 WS-ANO PIC 9 VALUE ZERO.
001745
001748
001749**************************************************
001750
001751 PROCEDURE DIVISION.
001752     OPEN INPUT EMPMAJ
001753     OPEN I-O EMPK
001754     IF FS-EMPK NOT EQUAL ZERO THEN
001755         DISPLAY 'ERR OPEN - FS-EMPK : ' FS-EMPK
001756         PERFORM ABEND-PROG
001757     END-IF
001758
001773     PERFORM LECT-EMPMAJ
001788     PERFORM UNTIL WS-FIN-EMPMAJ = 1
001789
001803       IF CREATION THEN
001804           PERFORM CREAT
001805       END-IF
001806       IF MODIFICATION THEN
001807           PERFORM MODIF
001817       END-IF
001818       IF SUPPRESSION THEN
001819           PERFORM SUPP
001820       END-IF
001821       IF INVALIDE THEN
001822           PERFORM INVALIDE
001823       END-IF
001824       PERFORM LECT-EMPMAJ
001825     END-PERFORM
001833
001834
001835     CLOSE EMPK
001836     IF FS-EMPK NOT EQUAL ZERO THEN
001840         DISPLAY 'ERR CLOSE - FS-EMPK : ' FS-EMPK
001900         PERFORM ABEND-PROG
002000     END-IF
002100     CLOSE EMPMAJ
002420
002500     STOP RUN.
002600
004522 LECT-EMPMAJ.
004523     READ EMPMAJ AT END
004524         DISPLAY 'FIN DU FICHIER EMPMAJ'
004525         MOVE 1 TO WS-FIN-EMPMAJ
004526     END-READ.
004527
004528 CREAT.
004529     WRITE ENR-EMPK FROM ENR-EMPMAJ
004530     EVALUATE FS-EMPK
004531         WHEN 22
004532             DISPLAY 'CREATION SUR EXISTANT-DOUBLON- ' CODE-EMPMAJ
004533         WHEN ZERO
004534             DISPLAY 'CREATION OK - ' CODE-EMPMAJ
004535         WHEN OTHER
004536             DISPLAY 'ERREUR WRITE FS-EMPK : ' FS-EMPK
004537             PERFORM ABEND-PROG
004538     END-EVALUATE.
004539
004540 MODIF.
004541     REWRITE ENR-EMPK FROM ENR-EMPMAJ
004542     EVALUATE FS-EMPK
004543         WHEN 23
004544             DISPLAY 'MODIFICATION SUR INEXSISTANT - ' CODE-EMPMAJ
004545         WHEN ZERO
004546             DISPLAY 'MODIFICATION OK - ' CODE-EMPMAJ
004547         WHEN OTHER
004548             DISPLAY 'ERREUR REWRITE FS-EMPK : ' FS-EMPK
004549             PERFORM ABEND-PROG
004550     END-EVALUATE.
004551
004552 SUPP.
004553     MOVE CODE-EMPMAJ TO CODE-EMPK
004554     DELETE EMPK
004555     EVALUATE FS-EMPK
004556         WHEN 23
004557             DISPLAY 'PAS POSSIBLE - ' CODE-EMPMAJ
004558         WHEN ZERO
004559             DISPLAY 'SUPP :) - ' CODE-EMPMAJ
004560         WHEN OTHER
004561             DISPLAY 'ERREUR DELETE FS-EMPK : ' FS-EMPK
004562             PERFORM ABEND-PROG
004563     END-EVALUATE.
004564
004565 INVALIDE.
004566     DISPLAY 'CODE MAJ INVALIDE'.
004567
004570 ABEND-PROG.
004600     DISPLAY '---- ABEND PROG ----'
004700     COMPUTE WS-ANO = 1 / WS-ANO.
