000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    LECTSEQ.
000300 AUTHOR.        ALEXIS.
000400 INSTALLATION.  AJC.
000500 DATE-WRITTEN.  19/06/2025.
000600 DATE-COMPILED.
000700 SECURITY.      PROGRAMME COBOL.
000800**************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001210
001300 INPUT-OUTPUT SECTION.
001400 FILE-CONTROL.
001500     SELECT GARES ASSIGN FGARES
001600     ORGANIZATION IS SEQUENTIAL.
001610**************************************************
001700 DATA DIVISION.
001701 FILE SECTION.
001702 FD GARES.
001703 01 ENR-GARES.
001704    05 NUM-GARE PIC XX.
001705    05 NOM-GARE PIC X(28).
001706
001710 WORKING-STORAGE SECTION.
001720 77 WS-FIN-GARES PIC 9 VALUE ZERO.
001734
001735**************************************************
001750 PROCEDURE DIVISION.
001770     OPEN INPUT GARES
001775     PERFORM LECT-GARES
001776
001777     PERFORM UNTIL WS-FIN-GARES = 1
001778          DISPLAY 'NUMERO GARE : ' NUM-GARE
001779          DISPLAY 'NOM GARE : ' NOM-GARE
001783          PERFORM LECT-GARES
001784     END-PERFORM
001785
001786     CLOSE GARES
001787
001790     STOP RUN.
001800
001900 LECT-GARES.
002000     READ GARES AT END
002100          DISPLAY 'FIN DU FICHIER GARES'
002200          MOVE 1 TO WS-FIN-GARES
002300     END-READ.
