000010*******************************************************************
000020*  PROGRAMME PERMET DE MONTRER LA GESTION DES TRANSACTIONS
000040*
000041*******************************************************************
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. A7CALC2.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SPECIAL-NAMES.
000700     DECIMAL-POINT IS COMMA.
000800
000900 DATA DIVISION.
001000 WORKING-STORAGE SECTION.
001100      COPY DFHBMSCA.
001200      COPY DFHAID.
001300      COPY A7MS2.
001800
001810********************************************************************
001820*  ZONE EST CONSTITUE DE 3 ELEMENTS
001830*  - COMMA-PGM 	: NOM DU PGM
001840*  - INFOS 		: INFORMATIONS A TRANSMETTRE
001863*
001864********************************************************************
001870
001900 01 ZONE.
002000    05 COMMA-PGM     PIC X(8) VALUE 'A7CALC2'.
002100    05 INFOS         PIC X(62).
002310
002391
002395
002397 01 ERR-MESS PIC X(50) VALUE 'FIN'.
002399 77 WS-CD-ERR     PIC 9(2).
002409
002510 77 WS-TEMPS PIC S9(15) COMP-3.
002520
002530 77 WS-NB1   PIC 9(2)  VALUE ZERO.
002540 77 WS-NB2   PIC 9(2)  VALUE ZERO.
002550 77 WS-RES   PIC 9(5)  VALUE ZERO.
002560
002600 PROCEDURE DIVISION.
002610*     PERFORM FIN-TOTALE
002800********************************************************
002900* EIBCALEN CORRESPOND A LAL LG DES PARAMETRES TRANSMIS
003000* SI EIBCALEN = 0 ==> PREMIERE FOIS
003100********************************************************
003110      EVALUATE EIBTRNID
003120       WHEN 'T7C2'
003200        IF EIBCALEN = ZERO
003201*             MOVE 'T7C2 VOIR' TO ERR-MESS
003202*             PERFORM FIN-TOTALE
003210                MOVE LOW-VALUE TO A7MAP2O
003310                PERFORM ENVOI-ECRAN
003400        END-IF
003500
003600********************************************************
003700* EIBAID PERMET DE RECUPERER LA TOUCHE APPUYEE
003800* DFHCLEAR ==> ESC
003900********************************************************
004000        IF   EIBAID = DFHCLEAR
004100              MOVE 'AU REVOIR' TO ERR-MESS
004200              PERFORM FIN-TOTALE
004300        ELSE
004310              INITIALIZE MESS2O
004400              MOVE 'TOUCHE INVALIDE !' TO MESS1O
004500              MOVE DFHBMUNP TO MESS1A
004600              MOVE DFHPINK   TO MESS1C
005470        END-IF
005473       WHEN OTHER
005476            CONTINUE
005477      END-EVALUATE
005478      PERFORM ENVOI-ECRAN
008500      .
008700
010610********************************************************************
010620*                       LISTE DES PARAGRAPHES
010640********************************************************************
010650 ENVOI-ECRAN.
010651        MOVE COMMA-PGM TO PGMNAMEO
010652        MOVE EIBTRNID  TO TRNNAMEO
010653
010654        EXEC CICS ASKTIME ABSTIME (WS-TEMPS) END-EXEC
010655
010656        EXEC CICS
010657          FORMATTIME ABSTIME (WS-TEMPS)
010658          DDMMYY (DATEJO)
010659          DATESEP ('/')
010660          TIME (HEUREO)
010661          TIMESEP (':')
010662        END-EXEC
010663
010664
010665********************************************************************
010666*       ICI ON ENVOIE LES DIFFERNTES MAPS CONSTITUANT LE MAPSET
010667********************************************************************
010670
010700* ENVOI MAP
010710*****************
010800      EXEC CICS
010900         SEND MAP('A7MAP2')
011000              MAPSET('A7MS2')
011600              RESP(WS-CD-ERR)
011610              ERASE
011620              CURSOR
011630              WAIT
011700      END-EXEC
011800      IF WS-CD-ERR  NOT EQUAL  DFHRESP(NORMAL)
011900           MOVE 'ERR SEND' TO ERR-MESS
012000           PERFORM FIN-TOTALE
012100      END-IF
013200
013210****************************************************
013220* REAFFICHE LA TRANSACTION, ELLE PERMET DE POUVOIR
013230* DE NOUVO RECUPERER LES ELEMENTS SAISIS
013240*****************************************************
013250     EXEC CICS
013260          RETURN TRANSID ('T7C2')
013270          COMMAREA (ZONE)
013280          LENGTH (LENGTH OF ZONE)
013290     END-EXEC
013291     .
013310
013320
014100
014110 FIN-TOTALE.
014120     EXEC CICS
014130       SEND FROM (ERR-MESS)
014140       LENGTH (LENGTH OF ERR-MESS)
014150       WAIT
014160       ERASE
014170     END-EXEC
014180     EXEC CICS RETURN END-EXEC.
014190
014200 CALCUL.
014210
014211
014212
014213
014214
014215
014216
014217
014218
014219
014220
014221
014222
014223
014224
014225
014226
014227
014228
014229
014230
014231
014232
014233
014240
014300
014400
