000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TP11TEST.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SPECIAL-NAMES.
000700     DECIMAL-POINT IS COMMA.
000800
000900 DATA DIVISION.
001000 WORKING-STORAGE SECTION.
001100
001200 01  INPUT-NOTE     PIC S9(2)V9(2).
001400
001500 01  RESULT            PIC SZ9(3)V9(2).
001600 01  EXPECTED-RESULT   PIC SZ9(3)V9(2).
001700
001800 01  LIB PIC X(30).
001900 01  L-SEP PIC X(30) VALUE ALL '*'.
002000
002100 LINKAGE SECTION.
002200 COPY TESTCONT.
002300
002400 PROCEDURE DIVISION USING TEST-CONTEXT.
002500
002600     PERFORM SOM-OF-TWO-POS-TEST.
002700     DISPLAY 'RUN ', TESTS-RUN, ' OK ', PASSES, ' KO ', FAILURES
002800     DISPLAY L-SEP
002900
003000     PERFORM SOM-OF-ONE-NEG-TEST.
003100     DISPLAY 'RUN ', TESTS-RUN, ' OK ', PASSES, ' KO ', FAILURES
003200     DISPLAY L-SEP
003300
003400     PERFORM SOM-OF-TWO-NEG-TEST.
003500     DISPLAY 'RUN ', TESTS-RUN, ' OK ', PASSES, ' KO ', FAILURES
003600     DISPLAY L-SEP
003700
003800     GOBACK.
003900
004000 SOM-OF-TWO-POS-TEST.
004100     MOVE 0 TO RESULT
004200     MOVE 5,10  TO INPUT-NUMBER1
004300     MOVE 7,35  TO INPUT-NUMBER2
004400     MOVE 12,45 TO EXPECTED-RESULT
004500     MOVE 'SOM-OF-TWO-POS-TEST' TO LIB
004600     CALL 'SOM' USING BY CONTENT INPUT-NUMBER1
004700                      BY CONTENT INPUT-NUMBER2
004800                      BY REFERENCE RESULT
004900     DISPLAY '******** ' LIB '*********'
005000     CALL 'ASSEQ' USING BY REFERENCE TEST-CONTEXT
005100                        BY CONTENT LIB
005200                        BY CONTENT EXPECTED-RESULT
005300                        BY CONTENT RESULT.
005400
005500
005600 SOM-OF-ONE-NEG-TEST.
005700     MOVE 0 TO RESULT
005800     MOVE -5,10  TO INPUT-NUMBER1
005900     MOVE 7,35  TO INPUT-NUMBER2
006000     MOVE 2,25 TO EXPECTED-RESULT
006100
006200     MOVE 'SOM-OF-ONE-NEG-TEST' TO LIB
006300     CALL 'SOM' USING BY CONTENT INPUT-NUMBER1
006400                      BY CONTENT INPUT-NUMBER2
006500                      BY REFERENCE RESULT
006600     DISPLAY '******** ' LIB '*********'
006700     CALL 'ASSEQ' USING BY REFERENCE TEST-CONTEXT
006800                        BY CONTENT LIB
006900                        BY CONTENT EXPECTED-RESULT
007000                        BY CONTENT RESULT.
007100
007200 SOM-OF-TWO-NEG-TEST.
007300      MOVE 0 TO RESULT
007400      MOVE -5,84  TO INPUT-NUMBER1
007500      MOVE -7,29  TO INPUT-NUMBER2
007600      MOVE -13,13 TO EXPECTED-RESULT
007700
007800      MOVE 'SOM-OF-TWO-NEG-TEST' TO LIB
007900     CALL 'SOM' USING BY CONTENT INPUT-NUMBER1
008000                      BY CONTENT INPUT-NUMBER2
008100                      BY REFERENCE RESULT
008200     DISPLAY '******** ' LIB '*********'
008300     CALL 'ASSEQ' USING BY REFERENCE TEST-CONTEXT
008400                        BY CONTENT LIB
008500                        BY CONTENT EXPECTED-RESULT
008600                        BY CONTENT RESULT.
008700
