000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TP10.
000300 AUTHOR.        ALEXIS.
000400 INSTALLATION.  AJC.
000500 DATE-WRITTEN.  01/07/2025.
000600 DATE-COMPILED.
000700 SECURITY.      PROGRAMME COBOL TP10.
000800**************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001210
001300 INPUT-OUTPUT SECTION.
001400 FILE-CONTROL.
001500     SELECT F1 ASSIGN FF1
001600     ORGANIZATION IS SEQUENTIAL.
001604     SELECT F2 ASSIGN FF2
001612     ORGANIZATION IS SEQUENTIAL.
001615
001620**************************************************
001700 DATA DIVISION.
001701 FILE SECTION.
001702 FD F1.
001703 01 ENR-F1.
001704    05 CLI-F1 PIC X(4).
001705    05 MONT-F1 PIC X(7).
001712
001713 FD F2.
001714 01 ENR-F2.
001715    05 CLI-F2 PIC X(4).
001716    05 MONT-F2 PIC X(7).
001734
001735 WORKING-STORAGE SECTION.
001745 77 WS-CUMUL-MONT PIC Z(6)9V99.
001746 77 WS-FIN-F1 PIC X VALUE ZERO.
001748 77 WS-FIN-F2 PIC X VALUE ZERO.
001749 77 WS-ANO PIC 9 VALUE ZERO.
001750 77 WS-HIGH-VALUE PIC X(4).
001751 77 WS-CLI-F1 PIC X(4).
001752 77 WS-CLI-F2 PIC X(4).
001753 77 WS-FLAG-F1 PIC X VALUE ZERO.
001754 77 WS-FLAG-F2 PIC X VALUE ZERO.
001755
001756**************************************************
001757
001758 PROCEDURE DIVISION.
001759     OPEN INPUT F1
001760     OPEN INPUT F2
001776
001777     PERFORM LECT-F1
001788     PERFORM UNTIL WS-FIN-F1 = 1
001789         MOVE WS-HIGH-VALUE TO WS-CLI-F1
001825     END-PERFORM
001833
001834     PERFORM LECT-F2
001835     PERFORM UNTIL WS-FIN-F2 = 1
001836         MOVE WS-HIGH-VALUE TO WS-CLI-F2
001839     END-PERFORM
001840
001841     PERFORM UNTIL WS-FIN-F1 = 0 OR WS-FIN-F2 = 0
001842         IF CLI-F1 < CLI-F2 THEN
001843             PERFORM TRT-F1
001844         ELSE
001845             IF CLI-F1 > CLI-F2 THEN
001846                 PERFORM TRT-F2
001847             ELSE
001848                 PERFORM TRT-F1
001849                 PERFORM TRT-F2
001850             END-IF
001851         END-IF
001852     END-PERFORM
001873
001880     CLOSE F1
002100     CLOSE F2
002420
002500     STOP RUN.
002600
004522 LECT-F1.
004523     READ F1 AT END
004524         DISPLAY 'FIN DU FICHIER F1.DATA'
004525         MOVE 1 TO WS-FIN-F1
004526     END-READ.
004527
004528 LECT-F2.
004529     READ F2 AT END
004530         DISPLAY 'FIN DU FICHIER F2.DATA'
004540         MOVE 1 TO WS-FIN-F2
004550     END-READ.
004567
004568 TRT-F1.
004569     MOVE CLI-F1 TO WS-CLI-F1
004570     PERFORM UNTIL WS-CLI-F1 = CLI-F1 AND WS-FIN-F1 = 0
004571         DISPLAY 'F1 MONTANT : ' MONT-F1
004572         PERFORM LECT-F1
004573         IF WS-FIN-F1 = 1 THEN
004574             MOVE 1 TO WS-FIN-F1
004575             MOVE WS-HIGH-VALUE TO CLI-F1
004576         END-IF
004577     END-PERFORM.
004578
004579 TRT-F2.
004580     MOVE CLI-F2 TO WS-CLI-F2
004581     PERFORM UNTIL WS-CLI-F2 = CLI-F2 AND WS-FIN-F2 = 0
004582         DISPLAY 'F2 MONTANT : ' MONT-F2
004583         PERFORM LECT-F2
004584         IF WS-FIN-F2 = 2 THEN
004585             MOVE 1 TO WS-FIN-F2
004586             MOVE WS-HIGH-VALUE TO CLI-F2
004587         END-IF
004588     END-PERFORM.
004589
004590
004591
004592
004593
004594
004595
004596
004597
004598
004599
004600
004601
004602
004603
004604
004605
004606
004607
004608
004609
004610 ABEND-PROG.
004620     DISPLAY '---- ABEND PROG ----'
004700     COMPUTE WS-ANO = 1 / WS-ANO.
