000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. P7HELLO.
000300
000400 ENVIRONMENT DIVISION.
000500
000600 DATA DIVISION.
000700 WORKING-STORAGE SECTION.
000800 77 WS-MESG-TEXT PIC X(13).
000900 77 WS-MESG-LENG PIC S9(4) COMP.
001000
001100 PROCEDURE DIVISION.
001200     MOVE 'HELLO WORLD !' TO WS-MESG-TEXT
001300     MOVE +13 TO WS-MESG-LENG
001400
001500     EXEC CICS
001600         SEND FROM (WS-MESG-TEXT)
001800              LENGTH (WS-MESG-LENG)
001900              ERASE
002000              WAIT
002100     END-EXEC.
002200
002300     EXEC CICS RETURN END-EXEC.
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. P7HELLO.
000300
000400 ENVIRONMENT DIVISION.
000500
000600 DATA DIVISION.
000700 WORKING-STORAGE SECTION.
000800 77 WS-MESG-TEXT PIC X(13).
000900 77 WS-MESG-LENG PIC S9(4) COMP.
001000
001100 PROCEDURE DIVISION.
001200     MOVE 'HELLO WORLD !' TO WS-MESG-TEXT
001300     MOVE +13 TO WS-MESG-LENG
001400
001500     EXEC CICS
001600         SEND FROM (WS-MESG-TEXT)
001800              LENGTH (WS-MESG-LENG)
001900              ERASE
002000              WAIT
002100     END-EXEC.
002200
002300     EXEC CICS RETURN END-EXEC.
