000100IDENTIFICATION DIVISION.
000200PROGRAM-ID. ASSEQ.
000210
000300DATA DIVISION.
000400WORKING-STORAGE SECTION.
000410
000500LINKAGE SECTION.
000600COPY TESTCONT.
00070001 TEST-NAME PIC X(30).
00080001 EXPECTED  PIC S9(3)V99.
00090001 ACTUAL    PIC S9(3)V99.
000910
001000PROCEDURE DIVISION USING TEST-CONTEXT
001100                         TEST-NAME
001200                         EXPECTED ACTUAL.
001300     ADD 1 TO TESTS-RUN
001310
001400     IF ACTUAL = EXPECTED THEN
001500         ADD 1 TO PASSES
001600     ELSE
001700         DISPLAY 'FAILED : ' TEST-NAME
001800         DISPLAY 'EXPECTED ' EXPECTED
001900         DISPLAY 'ACTUAL : ' ACTUAL
002000         ADD 1 TO FAILURES
002100     END-IF
002110
002200     GOBACK.
