000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TP04.
000300 AUTHOR.        ALEXIS.
000400 INSTALLATION.  AJC.
000500 DATE-WRITTEN.  24/06/2025.
000600 DATE-COMPILED.
000700 SECURITY.      PROGRAMME COBOL TP04.
000800**************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001210
001300 INPUT-OUTPUT SECTION.
001400 FILE-CONTROL.
001500     SELECT EMPK ASSIGN FEMPK
001600     ORGANIZATION IS INDEXED
001601     ACCESS MODE IS RANDOM
001602     RECORD KEY IS CODE-EMPK
001603     FILE STATUS IS FS-EMPK.
001606
001610**************************************************
001700 DATA DIVISION.
001701 FILE SECTION.
001702 FD EMPK.
001703 01 ENR-EMPK.
001704    05 CODE-EMPK  PIC X(5).
001705    05 NOM-EMPK   PIC X(15).
001706    05 PREN-EMPK  PIC X(15).
001707    05 CP-EMPK    PIC X(5).
001708    05 VILLE-EMPK PIC X(20).
001709    05 SALAIRE-EMPK PIC 9(7).
001710    05 FILLER PIC X(3).
001711
001712 WORKING-STORAGE SECTION.
001713 77 FS-EMPK PIC 99.
001714 77 WS-FIN-EMPK PIC 9 VALUE ZERO.
001715 77 WS-NB-EMPK PIC 99 VALUE ZERO.
001716 77 WS-ANO PIC 9 VALUE ZERO.
001717 77 WS-SYSIN PIC 9(5) VALUE ZERO.
001718 77 ED-NB-EMPK PIC 99 VALUE ZERO.
001719 77 ED-SALR PIC ZZ.ZZ9,99.
001735**************************************************
001736
001737 PROCEDURE DIVISION.
001738     OPEN INPUT EMPK
001739     IF FS-EMPK NOT EQUAL ZERO THEN
001740         DISPLAY 'ERR OPEN - FS-EMPK : ' FS-EMPK
001741         PERFORM ABEND-PROG
001742     END-IF
001743
001745     ACCEPT CODE-EMPK FROM SYSIN
001762     EVALUATE FS-EMPK
001763         WHEN ZERO
001766*            PERFORM AFF-EMPK
001767             PERFORM AFF-SYSIN
001768         WHEN 23
001769             DISPLAY CODE-EMPK ' EST INTROUVABLE'
001770         WHEN OTHER
001771             DISPLAY 'ERR READ - FS-EMPK : ' FS-EMPK
001772             PERFORM ABEND-PROG
001777     END-EVALUATE
001778
001779     CLOSE EMPK
001780     IF FS-EMPK NOT EQUAL ZERO THEN
001781         DISPLAY 'ERR CLOSE - FS-EMPK : ' FS-EMPK
001790         PERFORM ABEND-PROG
002000     END-IF
002200
002300*    PERFORM AFF-INFOS
002400     CLOSE EMPK
002500     STOP RUN.
002600
002700 AFF-EMPK.
002710     DISPLAY 'CODE : ' CODE-EMPK
002800     DISPLAY 'NOM : ' NOM-EMPK
002900     DISPLAY 'PRENOM : ' PREN-EMPK
003100     MOVE SALAIRE-EMPK TO ED-SALR
003200     DISPLAY 'SALAIRE : ' ED-SALR
003300     DISPLAY 'VILLE : ' VILLE-EMPK
003400     DISPLAY 'CODE POSTAL : ' CP-EMPK
003410     DISPLAY '---------------------------'.
003500
003600 AFF-ERR.
003700     DISPLAY 'CE CODE N''EST PAS ASSOCIE A UN EMPLOYE'.
003800
003900 LECT-EMPK.
004000     READ EMPK AT END
004100         DISPLAY 'FIN DU FICHIER EMPLOYE'
004200         MOVE 1 TO WS-FIN-EMPK
004300     END-READ.
004400
004502
004503 AFF-SYSIN.
004504     PERFORM UNTIL WS-SYSIN = '00000'
004507         MOVE WS-SYSIN TO CODE-EMPK
004508         READ CODE-EMPK
004509         EVALUATE FS-EMPK
004510             WHEN ZERO
004511                 PERFORM AFF-EMPK
004512             WHEN 23
004513                 DISPLAY 'INTROUVABLE'
004514             WHEN OTHER
004515                 DISPAY 'ERREUR : ' WS-SYSIN
004516         END-EVALUATE
004519     END-PERFORM.
004520
004521
004530 ABEND-PROG.
004600     DISPLAY '---- ABEND PROG ----'
004700     COMPUTE WS-ANO = 1 / WS-ANO.
004800
