000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TP01B.
000400 AUTHOR.        ALEXIS.
000500 INSTALLATION.  AJC.
000600 DATE-WRITTEN.  23/06/2025.
000700 DATE-COMPILED.
000800 SECURITY.      PROGRAMME COBOL TP01B.
000900**************************************************
001000 ENVIRONMENT DIVISION.
001100 CONFIGURATION SECTION.
001200 SPECIAL-NAMES.
001300     DECIMAL-POINT IS COMMA.
001400
001500 INPUT-OUTPUT SECTION.
001600 FILE-CONTROL.
001700     SELECT EMPLOYE ASSIGN FEMPLOYE
001800     ORGANIZATION IS SEQUENTIAL.
001900**************************************************
002000 DATA DIVISION.
002100 FILE SECTION.
002200 FD EMPLOYE.
002300 01 ENR-EMPLOYE.
002400    05 CODE-EMP     PIC X(5).
002500    05 NOM-EMP      PIC X(15).
002510    05 PREN-EMP     PIC X(15).
002520    05 CP-EMP       PIC X(5).
002530    05 VILLE-EMP    PIC X(20).
002540    05 SALAIRE-EMP  PIC 9(5)V99.
002550    05 FILLER       PIC XXX.
002600
002700 WORKING-STORAGE SECTION.
002800 77 WS-FIN-EMPLOYE PIC 9 VALUE ZERO.
002810 77 WS-NBR-EMPLOYE PIC 99 VALUE ZERO.
002900 77 WS-SALAIRE-TTL PIC 9(8)V99 VALUE ZERO.
002910 77 ED-SALAIRE-MOY PIC ZZ.ZZ9,99.
002920 77 ED-SALR        PIC ZZ.ZZ9,99.
002930 77 ED-NB-EMP      PIC Z(11).
002940 77 WS-CONCAT      PIC X(64) VALUE ALL SPACES
003000**************************************************
003100 PROCEDURE DIVISION.
003200     OPEN INPUT EMPLOYE
003300     PERFORM LECT-EMP
003400
003500     PERFORM UNTIL WS-FIN-EMPLOYE = 1
003600*        DISPLAY 'NOM : ' NOM-EMP
003700         PERFORM AFF-EMP
003900     END-PERFORM
004000
004100     CLOSE EMPLOYE
004300     STOP RUN.
004400
004500 LECT-EMP.
004600     READ EMPLOYE AT END
004700          DISPLAY 'FIN DU FICHIER EMPLOYE'
004800          MOVE 1 TO WS-FIN-EMPLOYE
004900     END-READ.
005000
005100 AFF-EMP.
005200     MOVE SPACE TO WS-CONCAT
005300     STRING
005400         'L''EMPLOYE ' DELIMITED BY SIZE
005500          PREN-EMP     DELIMITED BY '  '
005600          SPACE        DELIMITED BY SIZE
005700          NOM-EMP      DELIMITED BY '  '
005800          ' GAGNE '    DELIMITED BY SIZE
005900          ED-SALR      DELIMITED BY SIZE
005901          ' EUROS'     DELIMITED BY SIZE
005902          INTO WS-CONCAT
005903          ON OVERFLOW
005904             DISPLAY 'ZONE RES TROP PETITE'
005905     END-STRING
005906     DISPLAY WS-CONCAT
005907       .
