000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TP09.
000300
000310 ENVIRONMENT DIVISION.
000330 CONFIGURATION SECTION.
000331 SPECIAL-NAMES.
000332     DECIMAL-POINT IS COMMA.
000333 INPUT-OUTPUT SECTION.
000334 FILE-CONTROL.
000335     SELECT STUD ASSIGN STUDENTS
000336     ORGANIZATION IS SEQUENTIAL.
000341
000342 DATA DIVISION.
000350 FILE SECTION.
000361 FD STUD.
000362 01 ENR-STUD.
000363     05 MAT-STUD PIC X(2).
000364     05 NOM-STUD PIC X(10).
000365     05 NOTE-STUD PIC 99V9.
000366
000369
000370 WORKING-STORAGE SECTION.
000371 77 WS-FLAG-STUD PIC 9 VALUE ZERO.
000372     88 NFF-STUD VALUE 0.
000373     88 FF-STUD VALUE 1.
000374
000375 01 L-DETAIL.
000376     05 FILLER      PIC       XX      VALUE '* '.
000377     05 WS-MAT      PIC       99.
000378     05 FILLER      PIC       XXX     VALUE ' * '.
000379     05 WS-NOM      PIC       X(10).
000380     05 FILLER      PIC       XXX     VALUE ' * '.
000381     05 WS-NOTE     PIC       Z9,99.
000382     05 FILLER      PIC       XXX     VALUE ' * '.
000383     05 WS-MENTION  PIC       X(10).
000384     05 FILLER      PIC       XX      VALUE ' *'.
000385
000386 01 L-ETOILE      PIC X(40)         VALUE ALL '*'.
000387
000388
000389 PROCEDURE DIVISION.
000390
000391     SET NFF-STUD TO TRUE
000392     OPEN INPUT STUD
000393     PERFORM LECT-STUD
000394     PERFORM UNTIL FF-STUD
000395
000396         MOVE 'FR' TO WS-FORMAT
000397         CALL 'SMENTION' USING BY CONTENT NOTE-STUD
000398                               BY REFERENCE ED-MENTION
000399         DISPLAY LS-DETAIL
000402         PERFORM LECT-STUD
000403
000404     END-PERFORM
000405
000406     CLOSE STUD
000408
000409     GOBACK.
000410
000500
000510 LECT-STUD.
000520     READ STUD AT END
000530         DISPLAY 'FIN DU FICHIER STUDENTS'
000540         ST FF-STUD TO TRUE
000550     END-READ.
000560
