000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    DEMOK02.
000300 AUTHOR.        ALEXIS.
000400 INSTALLATION.  AJC.
000500 DATE-WRITTEN.  23/06/2025.
000600 DATE-COMPILED.
000700 SECURITY.      PROGRAMME COBOL.
000800**************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001210
001300 INPUT-OUTPUT SECTION.
001400 FILE-CONTROL.
001500     SELECT GAREK ASSIGN FGAREK
001600     ORGANIZATION IS INDEXED
001601     ACCESS MODE IS RANDOM
001602     RECORD KEY IS NUM-GAREK
001603     FILE STATUS IS FS-GAREK.
001606
001610**************************************************
001700 DATA DIVISION.
001701 FILE SECTION.
001702 FD GAREK.
001703 01 ENR-GAREKK.
001704    05 NUM-GAREK PIC XX.
001705    05 NOM-GAREK PIC X(28).
001706
001710 WORKING-STORAGE SECTION.
001711 77 FS-GAREK PIC 99.
001712 77 WS-ANO PIC 9 VALUE ZERO.
001735**************************************************
001750 PROCEDURE DIVISION.
001770     OPEN INPUT GAREK
001771     IF FS-GAREK NOT EQUAL ZERO THEN
001772          DISPLAY 'ERREUR OPEN GAREK ! FS-GAREK : ' FS-GAREK
001773          PERFORM ABEND-PROG
001774     END-IF
001775
001776     MOVE '03' TO NUM-GAREK
001777     READ GAREK
001787     EVALUATE FS-GAREK
001788       WHEN ZERO
001789           DISPLAY 'NOM GARE : ' NOM-GAREK
001790       WHEN 23
001791           DISPLAY NUM-GAREK ' EST INTROUVABLE'
001792       WHEN OTHER
001793           DISPLAY 'ERR READ GAREK : ' FS-GAREK
001794           PERFORM ABEND-PROG
001795     END-EVALUATE
001800
001801     CLOSE GAREK
001802     IF FS-GAREK NOT EQUAL ZERO THEN
001803          DISPLAY 'ERREUR CLOSE GAREK ! FS-GAREK : ' FS-GAREK
001804          PERFORM ABEND-PROG
001805     END-IF
001806
001807     STOP RUN.
001808
001809 ABEND-PROG.
001810      DISPLAY '---- ABEND PROG ----'
001811      COMPUTE WS-ANO = 1 / WS-ANO.
001812
001813
001814
001815
001816
001817
001820
001900
