000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TPTAB.
000300 AUTHOR.        ALEXIS.
000400 INSTALLATION.  AJC.
000500 DATE-WRITTEN.  25/06/2025.
000600 DATE-COMPILED.
000700 SECURITY.      PROGRAMME COBOL TP SUR LES TABLEAUX.
000800**************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001210
001610**************************************************
001700 DATA DIVISION.
001712 WORKING-STORAGE SECTION.
001713 01 ETIQ-TAB1.
001714     05 NOM-EMPLOYE OCCURS 3.
001715         10 NOM PIC X(10).
001716         10 VENTES PIC 9(5) OCCURS 6.
001717 01 CPT PIC 9.
001718 01 CPT-MOIS PIC 9.
001719 01 TOTAL-EMPLOYE PIC 9(6).
001720 01 LIGNE-AFFICHAGE.
001721     05 FILLER PIC X(2) VALUE '* '.
001722     05 AFF-NOM PIC X(10).
001723     05 FILLER PIC X(3) VALUE ' * '.
001724     05 AFF-TOTAL PIC Z(5).
001725     05 FILLER PIC X(2) VALUE ' *'.
001726 77 LIGNE-ETOILES PIC X(22) VALUE ALL '*'.
001735**************************************************
001736
001737 PROCEDURE DIVISION.
001738     MOVE 'SANDRINE' TO NOM(1)
001739     MOVE 1000 TO VENTES(1 , 1)
001740     MOVE 2000 TO VENTES(1 , 2)
001750     MOVE 3000 TO VENTES(1 , 3)
001760     MOVE 4000 TO VENTES(1 , 4)
001770     MOVE 4500 TO VENTES(1 , 5)
001780     MOVE 5000 TO VENTES(1 , 6)
001790
001800     MOVE "LISA" TO NOM(2)
001900     MOVE 1000 TO VENTES(2 , 1)
002000     MOVE 1100 TO VENTES(2 , 2)
002100     MOVE  600 TO VENTES(2 , 3)
002200     MOVE  900 TO VENTES(2 , 4)
002300     MOVE  950 TO VENTES(2 , 5)
002400     MOVE 1200 TO VENTES(2 , 6)
002500
002600     MOVE "PAUL" TO NOM(3)
002700     MOVE 1100 TO VENTES(3 , 1)
002800     MOVE 1000 TO VENTES(3 , 2)
002900     MOVE  900 TO VENTES(3 , 3)
003000     MOVE  750 TO VENTES(3 , 4)
003100     MOVE 1000 TO VENTES(3 , 5)
003200     MOVE 1300 TO VENTES(3 , 6).
003300
003400     PERFORM VARYING CPT FROM 1 BY 1 UNTIL CPT > 3
003500         MOVE 0 TO TOTAL-EMPLOYE
003600         PERFORM VARYING CPT-MOIS FROM 1 BY 1 UNTIL CPT-MOIS > 6
003700             ADD VENTES(CPT, CPT-MOIS) TO TOTAL-EMPLOYE
003800         END-PERFORM
003900         MOVE NOM(CPT) TO AFF-NOM
004000         MOVE TOTAL-EMPLOYE TO AFF-TOTAL
004100         DISPLAY LIGNE-ETOILES
004200         DISPLAY LIGNE-AFFICHAGE
004300     END-PERFORM
004400     DISPLAY LIGNE-ETOILES
004500     STOP RUN.
