000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TP01.
000400 AUTHOR.        ALEXIS.
000500 INSTALLATION.  AJC.
000600 DATE-WRITTEN.  20/06/2025.
000700 DATE-COMPILED.
000800 SECURITY.      PROGRAMME COBOL TP01.
000900**************************************************
001000 ENVIRONMENT DIVISION.
001100 CONFIGURATION SECTION.
001200 SPECIAL-NAMES.
001300     DECIMAL-POINT IS COMMA.
001400
001500 INPUT-OUTPUT SECTION.
001600 FILE-CONTROL.
001700     SELECT EMPLOYE ASSIGN FEMPLOYE
001800     ORGANIZATION IS SEQUENTIAL.
001900**************************************************
002000 DATA DIVISION.
002100 FILE SECTION.
002200 FD EMPLOYE.
002300 01 ENR-EMPLOYE.
002400    05 CODE-EMP     PIC X(5).
002500    05 NOM-EMP      PIC X(15).
002510    05 PREN-EMP     PIC X(15).
002520    05 CP-EMP       PIC X(5).
002530    05 VILLE-EMP    PIC X(20).
002540    05 SALAIRE-EMP  PIC 9(5)V99.
002550    05 FILLER       PIC X(3).
002600
002700 WORKING-STORAGE SECTION.
002800 77 WS-FIN-EMPLOYE PIC 9 VALUE ZERO.
002810 77 WS-NBR-EMPLOYE PIC 9(11) VALUE ZERO.
002900 77 WS-SALAIRE-TTL PIC 9(11)V99 VALUE ZERO.
002910 77 WS-SALAIRE-MOY PIC 9(11)V99 VALUE ZERO.
002920 77 WS-TSLM-MOY    PIC ZZ.ZZ9,99.
002930 77 WS-TNBR-EMP    PIC Z(11).
003000**************************************************
003100 PROCEDURE DIVISION.
003200     OPEN INPUT EMPLOYE
003300     PERFORM LECT-EMP
003400
003500     PERFORM UNTIL WS-FIN-EMPLOYE = 1
003600          DISPLAY 'NOM : ' NOM-EMP
003700          DISPLAY 'PRENOM : ' PREN-EMP
003710          DISPLAY 'SALAIRE : ' SALAIRE-EMP
003720          ADD 1 TO WS-NBR-EMPLOYE
003730          ADD SALAIRE-EMP TO WS-SALAIRE-TTL
003780          MOVE WS-SALAIRE-MOY TO WS-TSLM-MOY
003790          MOVE WS-NBR-EMPLOYE TO WS-TNBR-EMP
003800          PERFORM LECT-EMP
003900     END-PERFORM
003910     COMPUTE WS-SALAIRE-MOY = WS-SALAIRE-TTL/WS-NBR-EMPLOYE
003920       ON SIZE ERROR
003930       DISPLAY 'ERREUR CALCUL'
003940     END-COMPUTE
004000
004100     CLOSE EMPLOYE
004200     DISPLAY 'NOMBRE TOTAL EMPLOYES : ' WS-TNBR-EMP
004210     DISPLAY 'SALAIRE MOYEN : ' WS-TSLM-MOY
004300     STOP RUN.
004400
004500 LECT-EMP.
004600     READ EMPLOYE AT END
004700          DISPLAY 'FIN DU FICHIER EMPLOYE'
004800          MOVE 1 TO WS-FIN-EMPLOYE
004900     END-READ.
