000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TP01BB.
000210
000800********************************************************
000900 ENVIRONMENT DIVISION.
000901 CONFIGURATION SECTION.
000902 SPECIAL-NAMES.
000903     DECIMAL-POINT IS COMMA.
000905
000906 INPUT-OUTPUT SECTION.
000907 FILE-CONTROL.
000908      SELECT EMP ASSIGN FEMP
000909      ORGANIZATION IS SEQUENTIAL.
000910
000911********************************************************
000920 DATA DIVISION.
000921 FILE SECTION.
000922 FD EMP.
000923 01 ENR-EMP.
000924    05 CODE-EMP         PIC X(5).
000925    05 NOM-EMP          PIC X(15).
000926    05 PREN-EMP         PIC X(15).
000927    05 CP-EMP           PIC X(5).
000928    05 VILLE-EMP        PIC X(20).
000929    05 SALAIRE-EMP      PIC 9(5)V99.
000930    05 FILLER           PIC XXX.
000931
000932 WORKING-STORAGE SECTION.
000940 77 WS-FIN-EMP     PIC 9        VALUE ZERO.
000960 77 WS-NB-EMP      PIC 99       VALUE ZERO.
000961 77 WS-CUMUL-SAL   PIC 9(8)V99  VALUE ZERO.
000962
000963 77 ED-NB-EMP      PIC Z9.
000964 77 ED-SALR        PIC ZZ.ZZ9,99.
000965 77 ED-MOY         PIC ZZ.ZZ9,99.
000966
000967 77 WS-CONCAT      PIC X(64) VALUE ALL SPACES.
000968
000969********************************************************
000970 PROCEDURE DIVISION.
000980
000981     OPEN INPUT EMP
000982     PERFORM LECT-EMP
000986
000987     PERFORM UNTIL WS-FIN-EMP = 1
000988
000989          PERFORM AFF-EMP
000994
000995          PERFORM CALCUL
001001
001002          PERFORM LECT-EMP
001003
001004     END-PERFORM
001005
001006     PERFORM AFF-INFOS
001016     CLOSE EMP
001017
001020     STOP RUN.
001100
001110 AFF-EMP.
001112*    DISPLAY 'NOM : ' NOM-EMP
001113*    DISPLAY 'PRENOM : ' PREN-EMP
001114*    DISPLAY 'SALAIRE : ' SALAIRE-EMP
001115     MOVE SALAIRE-EMP TO ED-SALR
001116*    DISPLAY 'SALAIRE : ' ED-SALR
001117
001118* L'EMPLOYE PAULA MOLITO GAGNE 15.400,00 EUROS
001119     MOVE SPACE TO WS-CONCAT
001120
001121     STRING
001122        'L''EMPLOYE ' DELIMITED BY SIZE
001123         PREN-EMP     DELIMITED BY '  '
001124         SPACE        DELIMITED BY SIZE
001125         NOM-EMP      DELIMITED BY '  '
001126         ' GAGNE '    DELIMITED BY SIZE
001127         ED-SALR      DELIMITED BY SIZE
001128         ' EUROS'     DELIMITED BY SIZE
001129         INTO WS-CONCAT
001130         ON OVERFLOW
001131            DISPLAY 'ZONE RESULTAT TROP PETITE'
001132     END-STRING
001133     DISPLAY WS-CONCAT
001134     DISPLAY '***********************************'
001135     .
001136
001140 CALCUL.
001141     ADD 1 TO WS-NB-EMP
001142     COMPUTE WS-CUMUL-SAL = WS-CUMUL-SAL + SALAIRE-EMP
001143       ON SIZE ERROR
001144           DISPLAY 'ERR CALCUL CUMUL SALAIRE'
001145     END-COMPUTE.
001150
001160 AFF-INFOS.
001161     IF WS-NB-EMP > ZERO THEN
001162         COMPUTE ED-MOY = WS-CUMUL-SAL / WS-NB-EMP
001163         DISPLAY 'SALAIRE MOYEN : ' ED-MOY
001164         MOVE WS-NB-EMP TO ED-NB-EMP
001165         DISPLAY 'NB EMPLOYES : ' ED-NB-EMP
001166     ELSE
001167         DISPLAY 'AUCUN EMPLOYE DANS LE FICHIER'
001168     END-IF.
001169
001191
001200 LECT-EMP.
001210      READ EMP AT END
001220          DISPLAY 'FIN DU FICHIER EMPLOYE !'
001230          MOVE 1 TO WS-FIN-EMP
001240      END-READ.
