000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. A7PGMRES.
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SPECIAL-NAMES.
000800     DECIMAL-POINT IS COMMA.
000900 DATA DIVISION.
001000 WORKING-STORAGE SECTION.
001100      COPY DFHBMSCA.
001200      COPY DFHAID.
001300      COPY A7MSR.
001310
001341
001370
001400 01 WS-TEMPS PIC S9(15) COMP-3.
001500 01 CDERETOUR PIC 99.
001600 01 MESSR PIC X(50).
001700 01 ZONE.
001710    05 COMMA-PGM PIC X(8) VALUE 'A7PGMRES'.
002050    05 INFOS   PIC X(60).
002060
002100 LINKAGE SECTION.
002200 01  DFHCOMMAREA      PIC X(70).
002300 PROCEDURE DIVISION USING DFHCOMMAREA.
002360
002400        EVALUATE TRUE
002410           WHEN EIBTRNID = 'T7RS'
002420                IF EIBCALEN = 0
002421                      MOVE LOW-VALUE TO A7MAPRO
002422                      MOVE COMMA-PGM TO PGMNAMEO
002425                      MOVE 'NO CALCUL' TO RESO
002430                      PERFORM SEND-MAP-TRANSID
002431                ELSE
002432                      MOVE '---------' TO RESO
002433                      PERFORM TRAIT-CONVERSATION
002440                END-IF
002450
002460
002470           WHEN OTHER
002471                MOVE DFHCOMMAREA TO ZONE
002485
002492                      MOVE LOW-VALUE TO A7MAPRO
002493                      MOVE INFOS  TO RESO
002494
002496                      PERFORM SEND-MAP-TRANSID
002500
002501        END-EVALUATE
002502        .
002503
002504 SEND-MAP-TRANSID.
002505
002506      MOVE COMMA-PGM TO PGMNAMEO
002507      MOVE EIBTRNID  TO TRNNAMEO
002508      EXEC CICS ASKTIME ABSTIME (WS-TEMPS)
002509      END-EXEC
002510      EXEC CICS
002511         FORMATTIME ABSTIME (WS-TEMPS)
002512         DDMMYY (DATEJO)
002513         DATESEP ('/')
002514         TIME (HEUREO)
002515         TIMESEP (':')
002516      END-EXEC
002517
002524
002525      EXEC CICS
002526         SEND MAP('A7MAPR')
002527              MAPSET('A7MSR')
002528              FROM(A7MAPRO)
002529              ERASE
002534              RESP(CDERETOUR)
002535      END-EXEC
002536      IF CDERETOUR  NOT EQUAL  DFHRESP(NORMAL)
002537           MOVE 'ERR SEND' TO MESSR
002538           PERFORM FIN-TOTALE
002539      END-IF
002540
002541*****************************************************
002542*  REAFFICHE LA TRANSACTION, ELLE PERMET DE POUVOIR
002543*  DE NOUVO RECUPERER LES ELEMENTS SAISIS
002544*****************************************************
002545      EXEC CICS
002546           RETURN TRANSID ('T9RS')
002547           COMMAREA (ZONE)
002548           LENGTH (LENGTH OF ZONE)
002549      END-EXEC.
002550
002551
002552 FIN-TOTALE.
002553     EXEC CICS
002554       SEND FROM (MESSR)
002555       LENGTH (LENGTH OF MESSR)
002556       ERASE
002557     END-EXEC
002558     EXEC CICS RETURN END-EXEC.
002559
002560
002561 LECT-ECRAN.
002562***********************************************************
002563* CONSERVE DES INFOS D'UNE TACHE A UNE AUTRE              *
002564* STOCKE : NB TENTATIVES ET AUTHENTIFI O/N               *
002565***********************************************************
002566
002567
002568      EXEC CICS RECEIVE MAP ('A7MAPR')
002569                        MAPSET('A7MSR')
002570                        RESP (CDERETOUR)
002571      END-EXEC
002572      IF CDERETOUR  NOT EQUAL  DFHRESP(NORMAL)
002573         MOVE 'ERR RECEIVE' TO MESSR
002574         PERFORM FIN-TOTALE
002575      END-IF.
002576
002577
002578 TRAIT-CONVERSATION.
002579     MOVE DFHCOMMAREA TO ZONE
002580     EVALUATE EIBAID
002582         WHEN DFHPF3
002583             MOVE 'AU REVOIR' TO MESSR
002584             PERFORM FIN-TOTALE
002586         WHEN DFHCLEAR
002587         WHEN DFHENTER
002588            IF COMMA-PGM NOT EQUAL 'A7PGMRES'
002589                 PERFORM RETOUR-APPELANT
002590             ELSE
002591             MOVE 'AU REVOIR' TO MESSR
002592             PERFORM FIN-TOTALE
002593            END-IF
002600         WHEN OTHER
002601
002614          CONTINUE
002615
002616      END-EVALUATE.
002617
002618 TRAIT-RECH.
002620        CONTINUE
002643      .
002644
002645 RETOUR-APPELANT.
002646     EXEC CICS XCTL PROGRAM(COMMA-PGM)
002647                 RESP(CDERETOUR)
002648           COMMAREA (ZONE)
002649           LENGTH (LENGTH OF ZONE)
002650     END-EXEC
002651
002652      IF CDERETOUR  NOT EQUAL  DFHRESP(NORMAL)
002653         MOVE 'ERR RECEIVE' TO MESSR
002654         PERFORM FIN-TOTALE
002655      END-IF
002656
002657      .
002664
