000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    DEMO01.
000300 AUTHOR.        ALEXIS.
000400 INSTALLATION.  AJC.
000500 DATE-WRITTEN.  18/06/2025.
000600 DATE-COMPILED.
000700 SECURITY.      PREMIER PROGRAMME COBOL.
000800**************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001210
001300*INPUT-OUTPUT SECTION.
001400*FILE-CONTROL.
001500*    SELECT GARES ASSIGN TO FGARES
001600*    ORGANIZATION IS SEQUENTIAL.
001610**************************************************
001700 DATA DIVISION.
001710 WORKING-STORAGE SECTION.
001720 77 WS-NOM      PIC    X(25) VALUE 'VERRIER'.
001730 77 WS-AGE      PIC    9(3)  VALUE 21.
001731**************************************************
001750 PROCEDURE DIVISION.
001760      DISPLAY 'NOM : ' WS-NOM
001761      DISPLAY 'AGE : ' WS-AGE ' ANS'
001770
001780      STOP RUN.
