000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TP06.
000300 AUTHOR.        ALEXIS.
000400 INSTALLATION.  AJC.
000500 DATE-WRITTEN.  25/06/2025.
000600 DATE-COMPILED.
000700 SECURITY.      PROGRAMME COBOL TP06.
000800**************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001210
001300 INPUT-OUTPUT SECTION.
001400 FILE-CONTROL.
001500     SELECT EMPLOYE ASSIGN FEMPLOYE
001600     ORGANIZATION IS SEQUENTIAL.
001610**************************************************
001700 DATA DIVISION.
001701 FILE SECTION.
001702 FD EMPLOYE.
001703 01 ENR-EMP.
001704     05 CODE-EMP PIC X(5).
001705     05 NOM-EMP PIC X(15).
001706     05 PREN-EMP PIC X(15).
001707     05 SERV-EMP PIC X(15).
001708     05 FCT-EMP PIC X(10).
001709     05 SALAIRE-EMP PIC 9(5)V99.
001710     05 FILLER PIC X(3).
001711
001722 WORKING-STORAGE SECTION.
001727 77 WS-FIN-EMP PIC 9 VALUE ZERO.
001728 77 WS-ANO PIC 9 VALUE ZERO.
001739 77 WS-SERVICE-ACT PIC X(15) VALUE SPACES.
001740 77 WS-FONCTION-ACT PIC X(10) VALUE SPACES.
001741 77 WS-EFFECTIF-SERV PIC 9(4) VALUE ZERO.
001742 77 WS-CUMUL-SAL-SERV PIC 9(11)V99 VALUE ZERO.
001743 77 WS-EFFECTIF-FCT PIC 9(4) VALUE ZERO.
001744 77 WS-CUMUL-SAL-FCT PIC 9(11)V99 VALUE ZERO.
001745 77 WS-TOTAL-EFF PIC 9(4) VALUE ZERO.
001746 77 WS-TOTAL-SAL PIC 9(11)V99 VALUE ZERO.
001747
001748 77 WS-JOUR PIC 99.
001749 77 WS-MOIS PIC 99.
001750 77 WS-ANNEE PIC 9999.
001751 77 WS-DATE-HEURE PIC X(8).
001753
001756*01 WS-ED-TOT-EFF PIC Z(4).
001757*01 WS-ED-GEN PIC Z(7)9,99.
001758
001759 01 LIGNE-ETOILES.
001760     05 FILLER PIC X(53) VALUE ALL '*'.
001761
001762 01 LIGNE-DATE.
001763     05 FILLER PIC X(3) VALUE '*  '.
001764     05 FILLER PIC X(7) VALUE 'PARIS, '.
001765     05 FILLER PIC X(4) VALUE 'LE  '.
001766     05 WS-DATE-EDIT PIC X(10).
001767     05 FILLER PIC X(4) VALUE '   *'.
001768
001769 01 LIGNE-AFFICHAGE-SERV.
001770     05 FILLER PIC X(3) VALUE '*  '.
001771     05 FILLER PIC X(12) VALUE 'EFFECTIF : '.
001772*    05 WS-ED-EFF PIC Z(4).
001773     05 FILLER PIC X(7) VALUE SPACES.
001774     05 FILLER PIC X(17) VALUE 'TOTAL SALAIRES : '.
001775*    05 WS-ED-SAL PIC Z(7)9,99.
001776     05 FILLER PIC X(4) VALUE '   *'.
001777
001778 01 LIGNE-AFFICHAGE-FCT.
001779     05 FILLER PIC X(3) VALUE '*  '.
001780     05 FILLER PIC X(12) VALUE 'EFFECTIF : '.
001781     05 WS-ED-EFF PIC Z(4).
001782     05 FILLER PIC X(19) VALUE SPACES.
001783     05 FILLER PIC X(17) VALUE 'TOTAL SALAIRES : '.
001784     05 WS-ED-SAL PIC Z(7)9,99.
001785     05 FILLER PIC X(4) VALUE '   *'.
001786
001787 01 LIGNE-TOTAL-GENERAL.
001788     05 FILLER PIC X(1) VALUE '*'.
001789     05 FILLER PIC X(12) VALUE ' EFFECTIF : '.
001790     05 WS-ED-TOT-EFF PIC Z(4).
001791     05 FILLER PIC X(4) VALUE '  * '.
001792     05 FILLER PIC X(18) VALUE 'TOTAL SALAIRES : '.
001793     05 WS-ED-GEN PIC Z(7)9,99.
001794     05 FILLER PIC X(6) VALUE '  *'.
001799
001800**************************************************
001801
001802 PROCEDURE DIVISION.
001803     OPEN INPUT EMPLOYE
001804
001805     PERFORM GET-CURRENT-DATE
001806
001807     DISPLAY LIGNE-ETOILES
001808     DISPLAY LIGNE-DATE
001809     DISPLAY LIGNE-ETOILES
001810
001820     PERFORM LIRE-EMPLOYE
001830     IF WS-FIN-EMP = 1
001840         DISPLAY 'FICHIER EMPLOYE VIDE'
001850         PERFORM FIN-PROGRAMME
001860     END-IF
001870
001880     MOVE SERV-EMP TO WS-SERVICE-ACT
001890     MOVE FCT-EMP TO WS-FONCTION-ACT
001900
002000     MOVE 0 TO WS-EFFECTIF-SERV
002010     MOVE 0 TO WS-CUMUL-SAL-SERV
002020     MOVE 0 TO WS-EFFECTIF-FCT
002030     MOVE 0 TO WS-CUMUL-SAL-FCT
002100
002200     PERFORM TRAITER-SERVICES UNTIL WS-FIN-EMP = 1
002300     PERFORM AFFICHER-TOTAL-GENERAL
002400
002500     CLOSE EMPLOYE
002600     STOP RUN.
002700
002800 GET-CURRENT-DATE.
002900     ACCEPT WS-DATE-HEURE FROM DATE.
003000     MOVE WS-DATE-HEURE(7:2) TO WS-JOUR
003010     MOVE WS-DATE-HEURE(5:2) TO WS-MOIS
003020     MOVE WS-DATE-HEURE(1:2) TO WS-ANNEE.
003100
003200 LIRE-EMPLOYE.
003300     READ EMPLOYE AT END
003400         MOVE 1 TO WS-FIN-EMP
003500     END-READ.
003600
003700 TRAITER-SERVICES.
003800     PERFORM TRAITER-FONCTIONS UNTIL WS-FIN-EMP = 1
003900             OR SERV-EMP NOT EQUAL WS-SERVICE-ACT
004000     PERFORM AFFICHER-FONCTION
004100     PERFORM AFFICHER-SERVICE
004200
004300     ADD WS-EFFECTIF-SERV TO WS-TOTAL-EFF
004400     ADD WS-CUMUL-SAL-SERV TO WS-TOTAL-SAL
004500
004600     MOVE SERV-EMP TO WS-SERVICE-ACT
004700     MOVE FCT-EMP TO WS-FONCTION-ACT
004800     MOVE 0 TO WS-EFFECTIF-SERV
004900     MOVE 0 TO WS-CUMUL-SAL-SERV.
005000
005100 TRAITER-FONCTIONS.
005200     MOVE 0 TO WS-EFFECTIF-FCT
005300     MOVE 0 TO WS-CUMUL-SAL-FCT
005400     PERFORM UNTIL WS-FIN-EMP = 1
005500      OR SERV-EMP NOT EQUAL WS-SERVICE-ACT
005600      OR FCT-EMP NOT EQUAL WS-FONCTION-ACT
005700         ADD 1 TO WS-EFFECTIF-FCT
005800         ADD SALAIRE-EMP TO WS-CUMUL-SAL-FCT
005900         ADD 1 TO WS-EFFECTIF-SERV
006000         ADD SALAIRE-EMP TO WS-CUMUL-SAL-SERV
006100         PERFORM LIRE-EMPLOYE
006200     END-PERFORM.
006300
006900 AFFICHER-SERVICE.
006910     MOVE WS-EFFECTIF-SERV TO WS-ED-EFF
006920     MOVE WS-CUMUL-SAL-SERV TO WS-ED-SAL
006930
006940     DISPLAY LIGNE-ETOILES
006950     DISPLAY '*'
006960     DISPLAY '* SERVICE : ' WS-SERVICE-ACT
006970     DISPLAY '*'
006980     DISPLAY LIGNE-ETOILES
006990
006991     PERFORM AFFICHER-FONCTION-LISTE
007000
007100     DISPLAY LIGNE-AFFICHAGE-SERV
007200     DISPLAY LIGNE-ETOILES.
007300
007400 AFFICHER-FONCTION-LISTE.
007500     MOVE WS-EFFECTIF-FCT TO WS-ED-EFF
007600     MOVE WS-CUMUL-SAL-FCT TO WS-ED-SAL
007700     DISPLAY '*'
007800     DISPLAY '* FONCTION : ' WS-FONCTION-ACT
007900     DISPLAY '*'
008000     DISPLAY LIGNE-ETOILES
008100     DISPLAY LIGNE-AFFICHAGE-FCT
008200     DISPLAY LIGNE-ETOILES.
008300
008400 AFFICHER-FONCTION.
008500     MOVE WS-EFFECTIF-FCT TO WS-ED-EFF
008600     MOVE WS-CUMUL-SAL-FCT TO WS-ED-SAL
008700     DISPLAY '*'
008800     DISPLAY '* FONCTION : ' WS-FONCTION-ACT
008900     DISPLAY '*'
009000     DISPLAY LIGNE-ETOILES
009100     DISPLAY LIGNE-AFFICHAGE-FCT
009200     DISPLAY LIGNE-ETOILES.
009300
009400 AFFICHER-TOTAL-GENERAL.
009500     MOVE WS-TOTAL-EFF TO WS-ED-TOT-EFF
009510     MOVE WS-TOTAL-SAL TO WS-ED-GEN
009520
009530     DISPLAY LIGNE-ETOILES
009540     DISPLAY LIGNE-ETOILES
009550     DISPLAY '*'
009560     DISPLAY '* TOTAL GENERAL'
009570     DISPLAY '*'
009580     DISPLAY LIGNE-ETOILES
009590     DISPLAY LIGNE-TOTAL-GENERAL
009591     DISPLAY LIGNE-ETOILES.
010400
010500 FIN-PROGRAMME.
010600     DISPLAY '---- ABEND PROG ----'
010700     COMPUTE WS-ANO = 1 / WS-ANO.
010800
010900
