000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TP03.
000300 AUTHOR.        ALEXIS.
000400 INSTALLATION.  AJC.
000500 DATE-WRITTEN.  24/06/2025.
000600 DATE-COMPILED.
000700 SECURITY.      PROGRAMME COBOL TP03.
000800**************************************************
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001210
001300 INPUT-OUTPUT SECTION.
001400 FILE-CONTROL.
001500     SELECT EMPK ASSIGN FEMPK
001600     ORGANIZATION IS INDEXED
001601     ACCESS MODE IS SEQUENTIAL
001602     RECORD KEY IS CODE-EMPK
001603     FILE STATUS IS FS-EMPK.
001606
001610**************************************************
001700 DATA DIVISION.
001701 FILE SECTION.
001702 FD EMPK.
001703 01 ENR-EMPK.
001704    05 CODE-EMPK  PIC X(5).
001705    05 NOM-EMPK   PIC X(15).
001706    05 PREN-EMPK  PIC X(15).
001707    05 CP-EMPK    PIC X(5).
001708    05 VILLE-EMPK PIC X(20).
001709    05 SALAIRE-EMPK PIC 9(7).
001710    05 FILLER PIC X(3).
001711
001712 WORKING-STORAGE SECTION.
001713 77 FS-EMPK PIC 99.
001714 77 WS-FIN-EMPK PIC 9 VALUE ZERO.
001715 77 WS-NB-EMPK PIC 99 VALUE ZERO.
001716 77 WS-ANO PIC 9 VALUE ZERO.
001717 77 WS-CONCAT PIC X(53) VALUE ALL SPACES.
001718*15+1+15+7+9+6
001719 77 WS-CUMUL-SAL PIC 9(8)V99 VALUE ZERO.
001720 77 ED-SALAIRE-EMPK PIC ZZ.ZZ9,99.
001730 77 ED-MOY PIC ZZ.ZZ9,99.
001735**************************************************
001750 PROCEDURE DIVISION.
001770     OPEN INPUT EMPK
001771     ACCEPT CODE-EMPK FROM SYSIN
001772     START EMPK KEY >= CODE-EMPK
001773
001787     EVALUATE FS-EMPK
001788       WHEN ZERO
001790           DISPLAY 'NOM EMPLOYE : ' NOM-EMPK
001791           PERFORM BALAYAGE-FICHIER
001792           PERFORM CALCUL
001793           PERFORM AFF-SALAIRE
001794*          PERFORM AFF-EMP
001795       WHEN 23
001796         DISPLAY CODE-EMPK ' EST INTROUVABLE'
001797       WHEN OTHER
001798         DISPLAY 'ERR READ EMPK : ' FS-EMPK
001799         PERFORM ABEND-PROG
001800     END-EVALUATE
001801
001804     CLOSE EMPK
001805     IF FS-EMPK NOT EQUAL ZERO THEN
001806         DISPLAY 'ERREUR CLOSE EMPK ! FS-EMPK : ' FS-EMPK
001807         PERFORM ABEND-PROG
001808     END-IF
001809
001810     STOP RUN.
001811
001812*AFF-EMP.
001813*    MOVE SPACE TO WS-CONCAT
001814*    STRING
001815*       PREN-EMPK DELIMITED BY '  '
001816*       SPACE DELIMITED BY SIZE
001817*       NOM-EMPK DELIMITED BY '  '
001818*       ' GAGNE ' DELIMITED BY SIZE
001819*       SALAIRE-EMPK DELIMITED BY SIZE
001820*       ' EUROS' DELIMITED BY SIZE
001821*       INTO WS-CONCAT
001822*       ON OVERFLOW
001823*          DISPLAY 'ZONE RESULTAT TROP PETITE'
001824*    END-STRING
001830*    DISPLAY WS-CONCAT.
001831
001832 LECT-EMPK.
001833     READ EMPK AT END
001834         DISPLAY 'FIN DU FICHIER EMPLOYE'
001835         MOVE 1 TO WS-FIN-EMPK
001836     END-READ.
001837
001838 ABEND-PROG.
001839     DISPLAY '---- ABEND PROG ----'
001840     COMPUTE WS-ANO = 1 / WS-ANO.
001842
001843
001844 CALCUL.
001845     ADD 1 TO WS-NB-EMPK
001846     COMPUTE WS-CUMUL-SAL = WS-CUMUL-SAL + SALAIRE-EMPK
001847         ON SIZE ERROR
001848             DISPLAY 'ERR CALCUL CUMUL SALAIRE'
001849     END-COMPUTE.
001850
001851 AFF-SALAIRE.
001852     IF WS-NB-EMPK > ZERO THEN
001854         COMPUTE ED-MOY = WS-CUMUL-SAL / WS-NB-EMPK
001855         DISPLAY 'SALAIRE MOYEN : ' ED-MOY
001856         DISPLAY 'NOMBRE EMPLOYE : ' WS-NB-EMPK
001857     ELSE
001858         DISPLAY 'AUCUN EMPLOYE DANS LE FICHIER'
001859     END-IF.
001860
001861 BALAYAGE-FICHIER.
001862     READ EMPK
001863     PERFORM UNTIL FS-EMPK > ZERO
001864         ADD 1 TO WS-NB-EMPK
001865         DISPLAY NOM-EMPK
001866         READ EMPK
001867     END-PERFORM
001868     PERFORM CALCUL
001869     PERFORM AFF-SALAIRE
001871     IF FS-EMPK > 0
001872         DISPLAY 'FIN FICHIER EMPK'
001873         PERFORM ABEND-PROG
001874     END-IF.
