000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TP03.
000210
000800********************************************************
000900 ENVIRONMENT DIVISION.
000901 CONFIGURATION SECTION.
000902 SPECIAL-NAMES.
000903     DECIMAL-POINT IS COMMA.
000905
000906 INPUT-OUTPUT SECTION.
000907 FILE-CONTROL.
000908      SELECT EMPK ASSIGN FEMPK
000909      ORGANIZATION IS INDEXED
000910      ACCESS MODE IS DYNAMIC
000911      RECORD KEY IS CODE-EMPK
000912      FILE STATUS IS FS-EMPK.
000913
000914********************************************************
000920 DATA DIVISION.
000921 FILE SECTION.
000922 FD EMPK.
000923 01 ENR-EMPK.
000924    05 CODE-EMPK        PIC X(5).
000925    05 NOM-EMPK         PIC X(15).
000926    05 PREN-EMPK        PIC X(15).
000927    05 CP-EMPK          PIC X(5).
000928    05 VILLE-EMPK       PIC X(20).
000929    05 SALAIRE-EMPK     PIC 9(5)V99.
000930    05 FILLER           PIC XXX.
000931
000932 WORKING-STORAGE SECTION.
000940 77 FS-EMPK        PIC 99.
000966
000968 77 WS-ANO         PIC 9 VALUE ZERO.
000969
000970 77 WS-CUMUL-SALR    PIC 9(8)V99   VALUE ZERO.
000971 77 WS-NB-EMP        PIC 99        VALUE ZERO.
000972 77 ED-MOY-SALR      PIC ZZ.ZZ9,99.
000973 77 ED-SALR          PIC ZZ.ZZ9,99.
000974********************************************************
000975 PROCEDURE DIVISION.
000980
000981     PERFORM OUVRIR-FICHIER
000982
000983     PERFORM POSITION-FICHIER
001000
001001     PERFORM FERMER-FICHIER
001010
001030     STOP RUN.
001146
001147 BALAYAGE-FICHIER.
001148      READ EMPK NEXT
001149      PERFORM VARYING WS-NB-EMP FROM 0 BY 1 UNTIL
001150                                    FS-EMPK NOT EQUAL ZERO
001151           DISPLAY 'NOM : ' NOM-EMPK
001152           MOVE SALAIRE-EMPK TO ED-SALR
001153           DISPLAY 'SALAIRE : ' ED-SALR
001154
001155           ADD SALAIRE-EMPK TO WS-CUMUL-SALR
001156
001157           READ EMPK NEXT
001158
001159      END-PERFORM
001160
001161      IF FS-EMPK NOT EQUAL 10
001162        DISPLAY 'ERR READ APRES START EMPK - FS-EMPK : ' FS-EMPK
001163        PERFORM ABEND-PROG
001164      ELSE
001165          IF FS-EMPK = 10 AND WS-NB-EMP > 0 THEN
001166              COMPUTE ED-MOY-SALR = WS-CUMUL-SALR / WS-NB-EMP
001167              DISPLAY 'SALAIRE MOYEN : ' ED-MOY-SALR
001168              DISPLAY 'NB EMPLOYES : ' WS-NB-EMP
001169          END-IF
001170      END-IF.
001171
001172 POSITION-FICHIER.
001173
001174     ACCEPT CODE-EMPK FROM SYSIN
001175     START EMPK KEY >= CODE-EMPK
001176     EVALUATE FS-EMPK
001177       WHEN ZERO
001178         PERFORM BALAYAGE-FICHIER
001179       WHEN 23
001180         DISPLAY 'AUCUN ENREGISTREMENT POUR CODE-EMPK ' CODE-EMPK
001181       WHEN OTHER
001182         DISPLAY 'ERR START EMPK - FS-EMPK : ' FS-EMPK
001183         PERFORM ABEND-PROG
001190     END-EVALUATE.
001261
001262 OUVRIR-FICHIER.
001263     OPEN INPUT EMPK
001264     IF FS-EMPK NOT EQUAL ZERO
001265         DISPLAY 'ERR OPEN EMPK - FS-EMPK : ' FS-EMPK
001266         PERFORM ABEND-PROG
001267     END-IF.
001268
001269 FERMER-FICHIER.
001270     CLOSE EMPK
001271     IF FS-EMPK NOT EQUAL ZERO
001272         DISPLAY 'ERR CLOSE EMPK - FS-EMPK : ' FS-EMPK
001273         PERFORM ABEND-PROG
001274     END-IF.
001275
001276
001277
001278 ABEND-PROG.
001279       DISPLAY '---- ABEND-PROG ----'
001280       COMPUTE WS-ANO = 1 / WS-ANO.
001300
