//STEP01   EXEC PGM=IEFBR14                                             00010000
//SYSOUT   DD SYSOUT=*                                                  00020000
//CRETEST  DD DSN=API7.AJC.TEST10.DATA,DISP=(NEW,CATLG,DELETE),         00030000
//     DCB=(LRECL=25,RECFM=FB,BLKSIZE=250),DSORG=PS,                    00040000
//     SPACE=(TRK,(3,2),RLSE)                                           00050000
