//API7PRIN JOB (ACCT#),'STEEVEA',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),     00010000
//             NOTIFY=&SYSUID,REGION=4M,TIME=(,30)                      00020000
//****************************************************************      00030000
//* EXECUTION DU PROGRAMME API7.SOURCE.COBOL(TP09)                      00031000
//****************************************************************      00031100
//STEP01   EXEC PGM=PRINC                                               00031200
//STEPLIB  DD DSN=API7.COBOL.LOAD,DISP=SHR                              00031300
//SYSOUT  DD SYSOUT=*                                                   00031500
