//EXOJCL JOB (ACCT#),'ALEXIS',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,REGION=4M,TIME=(,30),RESTART=*
//*SUPPRESSION DU FICHIER API7.AJC.TESTS.DATA
//********************************************
//SUPFIC EXEC PGM=IEFBR14
//FIC1   DD DSN=API7.AJC.TESTS.DATA,DISP=(OLD,DELETE)
//SYSOUT DD SYSOUT=*
//*CREATION DU FICHIER API7.AJC.FICTEST.DATA
//********************************************
//CREFIC EXEC PGM=IEFBR14
//FIC2   DD DSN=API7.AJC.FICTEST.DATA,DISP=(NEW,CATLG,CATLG),
//     SPACE=(TRK,(3,2),RLSE),DCB=(LRECL=70,BLKSIZE=700),
//     RECFM=FB
//SYSOUT DD SYSOUT=*
