//API7D12  JOB (ACCT#),'ALEXISV',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID,REGION=4M,TIME=(,30)
//****************************************************************
//* TRIER LE FICHIER SUIVANT :
//*    API7.AJC.ELEVES.DATA (VILLE CROISSANTE, NOM DECROISSANT)
//****************************************************************
//TRIELEVE EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=API7.AJC.ELEVES.DATA,DISP=SHR
//SORTWORK DD DSN=&&TEMP,DISP=(NEW,PASS)
//SORTOUT  DD DSN=API7.AJC.TRIELEVE.DATA,DISP=(NEW,CATLG,DELETE),
//        DCB=(LRECL=80,RECFM=FB,BLKSIZE=800),
//        SPACE=(TRK,(1,1),RLSE)
//SYSIN    DD *
 SORT FIELDS=(20,10,CH,A,3,17,CH,D)
/*
