//API7D3   JOB (ACCT#),'ALEXISV',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID,REGION=4M,TIME=(,30),
//             RESTART=*
//* CREATION DU FICHIER API7.AJC.TEST2.DATA                      *
//****************************************************************
//STEP01   EXEC PGM=IEFBR14
//FICH2    DD DSN=API7.AJC.TEST2.DATA,DISP=(NEW,CATLG,DELETE),
//     DCB=(LRECL=50,RECFM=FB,BLKSIZE=500),DSORG=PS,
//     SPACE=(TRK,(1,2),RLSE)
//SYSOUT   DD SYSOUT=*
