//API7EX5  JOB (ACCT#),'ALEXIS',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID,REGION=4M,TIME=(,30)
//****************************************************************
//*  DEFINITION LA BIBLIO CONTENANT LA PROCEDURE
//****************************************************************
//LIBPROC  JCLLIB ORDER=API7.SOURCE.PROCS
//****************************************************************
//APPEL    EXEC PROC=PROCEXO5,NOMFIC=&SYSUID..AJC.ALEXIS.DATA,
//          SORTIE=Z
