//API7COB1 JOB (ACCT#),'ALEXISV',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID,REGION=4M,TIME=(,30)
//****************************************************************
//* EXECUTION DU PROGRAMME API7.SOURCE.COBOL(DEMO01)
//****************************************************************
//STEP01   EXEC PGM=DEMO01
//STEPLIB  DD DSN=API7.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
