//API7TP02 JOB (ACCT#),'ALEXISV',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),     00020000
//             NOTIFY=&SYSUID,REGION=4M,TIME=(,30)                      00030000
//****************************************************************      00040000
//* EXECUTION DU PROGRAMME API7.SOURCE.COBOL(TP02)                      00050000
//****************************************************************      00060000
//STEP01   EXEC PGM=TP02                                                00070000
//STEPLIB  DD DSN=API7.COBOL.LOAD,DISP=SHR                              00080000
//FEMPK    DD DSN=API7.AJC.EMPLOYE.KSDS,DISP=SHR                        00090001
//SYSOUT   DD SYSOUT=*                                                  00100000
